cf/Documents/ИнвентаризацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ИнвентаризацияТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ИнвентаризацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		
		ОбработкаОтвета = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект);
		ПоказатьВопрос(ОбработкаОтвета, "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоОстаткамНаСервере();
		
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.Номенклатура,
		|	ПартииТоваровОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоУчет,
		|	- ПартииТоваровОстатки.КоличествоОстаток КАК Отклонение,
		|	ПартииТоваровОстатки.Партия.ЗакупочнаяЦена КАК Цена,
		|	ПартииТоваровОстатки.СуммаОстаток КАК СуммаУчет,
		|	ПартииТоваровОстатки.Партия
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Склад = &Склад) КАК ПартииТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата",        Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад",       Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаИнвентаризации = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИнвентаризации, Выборка);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПользователя(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОстаткамНаСервере();
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьУчетныеКоличества(Команда)

	; // Задел на будущее
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	ЗначенияОтборов = Новый Структура;
	ЗначенияОтборов.Вставить("Владелец", ТекСтр.Номенклатура);
	ЗначенияОтборов.Вставить("Организация", Объект.Организация);
	ЗначенияОтборов.Вставить("Склад", Объект.Склад);  	
	ЗначенияОтборов.Вставить("ДатаОстатков", Объект.Дата);

	ПараметрыФормы = Новый Структура("Отбор", ЗначенияОтборов);
	
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборПартииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Партии.Форма.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОбработкаОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	;

КонецПроцедуры

&НаКлиенте 
Процедура  ВыборПартииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	Если ВыбранноеЗначение <> неопределено Тогда
		ТекСтр.Партия = ВыбранноеЗначение;
		
		
		Цена = 0;
		Количество = 0;
		
		ЗаполнитьЦенуУчетноеКоличество(ВыбранноеЗначение, Цена, Количество);
		
		ТекСтр.Цена = Цена;
		текСтр.КоличествоУчет = Количество;
		текСтр.СуммаУчет = ТекСтр.Цена * ТекСтр.КоличествоУчет;
		текСтр.Отклонение = текСтр.Количество - текСтр.КоличествоУчет;
		
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

Процедура ЗаполнитьЦенуУчетноеКоличество(Партия, Цена, Количество)
	
	Цена = Партия.ЗакупочнаяЦена;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.КоличествоОстаток,
		|	ПартииТоваровОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Партия = &Партия
		|				И Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ПартииТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата",         Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Партия.Владелец);
	Запрос.УстановитьПараметр("Организация",  Объект.Организация);
	Запрос.УстановитьПараметр("Партия",       Партия);
	Запрос.УстановитьПараметр("Склад",        Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Количество = Выборка.КоличествоОстаток;
		
	КонецЕсли;
	    	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал()
	
	ИтогоУчет = Объект.Товары.Итог("СуммаУчет");
	Итого     = объект.Товары.Итог("Сумма");
	
	Отклонение = Итого - ИтогоУчет;
		
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	текСтр.Отклонение = текСтр.Количество - текСтр.КоличествоУчет;
	ТекСтр.Сумма = ТекСтр.Количество * ТекСтр.Цена;
	
	ОбновитьПодвал();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодвал();

КонецПроцедуры
